RT-Thread/rt-thread/bsp/n32g452xx/Libraries/n32g45x_std_periph_driver/inc/n32g45x_xfmc.h
/*****************************************************************************
 * Copyright (c) 2019, Nations Technologies Inc.
 *
 * All rights reserved.
 * ****************************************************************************
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * - Redistributions of source code must retain the above copyright notice,
 * this list of conditions and the disclaimer below.
 *
 * Nations' name may not be used to endorse or promote products derived from
 * this software without specific prior written permission.
 *
 * DISCLAIMER: THIS SOFTWARE IS PROVIDED BY NATIONS "AS IS" AND ANY EXPRESS OR
 * IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * DISCLAIMED. IN NO EVENT SHALL NATIONS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
 * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,
 * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
 * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
 * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * ****************************************************************************/

/**
 * @file n32g45x_xfmc.h
 * @author Nations
 * @version v1.0.1
 *
 * @copyright Copyright (c) 2019, Nations Technologies Inc. All rights reserved.
 */
#ifndef __N32G45X_XFMC_H__
#define __N32G45X_XFMC_H__

#ifdef __cplusplus
extern "C" {
#endif

#include "n32g45x.h"

/** @addtogroup N32G45X_StdPeriph_Driver
 * @{
 */

/** @addtogroup XFMC
 * @{
 */

/** @addtogroup XFMC_Exported_Types
 * @{
 */

/**
 * @brief  Timing parameters For NOR/SRAM Banks
 */
typedef struct
{
    uint32_t AddrSetTime;       /*!< Defines the number of HCLK cycles to configure
                                    the duration of the address setup time.
                                    This parameter can be a value between 0 and 0xF.
                                    @note: It is not used with synchronous NOR Flash memories. */

    uint32_t AddrHoldTime;      /*!< Defines the number of HCLK cycles to configure
                                    the duration of the address hold time.
                                    This parameter can be a value between 0 and 0xF.
                                    @note: It is not used with synchronous NOR Flash memories.*/

    uint32_t DataSetTime;       /*!< Defines the number of HCLK cycles to configure
                                    the duration of the data setup time.
                                    This parameter can be a value between 1 and 0xFF.
                                    @note: It is used for SRAMs, ROMs and asynchronous multiplexed NOR Flash memories. */

    uint32_t BusRecoveryCycle;  /*!< Defines the number of HCLK cycles to configure 
                                    the duration of the bus turnaround.
                                    This parameter can be a value between 0 and 0xF.
                                    @note: It is only used for multiplexed NOR Flash memories. */

    uint32_t ClkDiv;            /*!< Defines the period of CLK clock output signal, expressed in number of HCLK cycles.
                                    This parameter can be a value between 1 and 0xF.
                                    @note: This parameter is not used for asynchronous NOR Flash, SRAM or ROM accesses. */

    uint32_t DataLatency;       /*!< Defines the number of memory clock cycles to issue
                                    to the memory before getting the first data.
                                    The value of this parameter depends on the memory type as shown below:
                                    - It must be set to 0 in case of a CRAM
                                    - It is don't care in asynchronous NOR, SRAM or ROM accesses
                                    - It may assume a value between 0 and 0xF in NOR Flash memories
                                      with synchronous burst mode enable */

    uint32_t AccMode;           /*!< Specifies the asynchronous access mode.
                                    This parameter can be a value of @ref XFMC_Access_Mode */
} XFMC_NorSramTimingInitType;

/**
 * @brief  XFMC NOR/SRAM Init structure definition
 */

typedef struct
{
    XFMC_Bank1_Block *Block;    /*!< Specifies the NOR/SRAM memory bank block that will be used.
                                    This parameter can be a XFMC_BANK1_BLOCK1 or XFMC_BANK1_BLOCK2 */

    uint32_t DataAddrMux;       /*!< Specifies whether the address and data values are
                                    multiplexed on the databus or not.
                                    This parameter can be a value of @ref XFMC_Data_Address_Bus_Multiplexing */

    uint32_t MemType;           /*!< Specifies the type of external memory attached to
                                    the corresponding memory bank.
                                    This parameter can be a value of @ref XFMC_Memory_Type */

    uint32_t MemDataWidth;      /*!< Specifies the external memory device width.
                                    This parameter can be a value of @ref XFMC_Data_Width */

    uint32_t BurstAccMode;      /*!< Enables or disables the burst access mode for Flash memory,
                                    valid only with synchronous burst Flash memories.
                                    This parameter can be a value of @ref XFMC_Burst_Access_Mode */

    uint32_t AsynchroWait;      /*!< Enables or disables wait signal during asynchronous transfers,
                                    valid only with asynchronous Flash memories.
                                    This parameter can be a value of @ref AsynchroWait */

